[
  {
    "content": [
      "The Longines Masters of Paris will feature a new pony class this year. Some of the top riders in the sport got their start on the little horses.",
      "She is one of the most successful show jumpers in the world, but she says 70 percent of her sport is the horse.",
      "In 1958 he and two others became the first to scale a 2,900-foot granite wall in Yosemite National Park in California that many considered practically unclimbable.",
      "The retired tight end did not meet the N.F.L.’s deadline to be reinstated.",
      "Critics accuse the kingdom of “sportswashing” as international entertainment businesses shrug off human rights concerns.",
      "Lamar Jackson powered the Ravens past the 49ers, the Patriots were upset by the Texans, and several of the N.F.L.’s basement dwellers enjoyed a day in the sun.",
      "Quarterback Lamar Jackson converted two critical short-yardage runs on Baltimore’s winning drive, then Justin Tucker kicked a 49-yard field goal as time expired.",
      "Playing without Myles Garrett and Mason Rudolph, the A.F.C. North face-off played out more predictably than the teams’ last meeting.",
      "Quarterback Andy Dalton, who was benched after the Bengals’ eighth loss, returned and gave Coach Zac Taylor his first win as a head coach.",
      "Aaron Rodgers threw four touchdown passes in snowy conditions as the Packers extended the Giants’ losing streak, their longest in 15 years."
    ]
  },
  {
    "title": [
      "Pony Show Jumpers Deliver Big Thrills",
      "Edwina Tops-Alexander Knows It’s Not All About Her",
      "Wayne Merry, Climber Who Conquered El Capitan, Dies at 88",
      "Rob Gronkowski Will Not Return for Patriots’ Playoff Run",
      "Saudi Arabia Embraces Western Sports to Rehabilitate Global Image",
      "N.F.L. Week 13: What We Learned",
      "Ravens Outlast 49ers With a Strong Finishing Kick",
      "Steelers Cling to Playoff Hopes, the Browns to the Idea of a Rivalry",
      "Bengals Are No Longer Winless, Thanks to the Jets",
      "Green Bay Hands the Giants Their Eighth Loss in a Row"
    ]
  }
]