[
  {
    "content": [
      "E-commerce is the most popular technology nowadays. While E-commerce development is the growing market, emerging marketplaces are poised to become the next mega-market as the adoption of the internet increases continuously. Growing markets are the hotbeds for e-commerce that comes with unique possibilities and challenges across the countries.\n\nIn rising markets, e-commerce has been developing exponentially, and at a cost may soon exceed the developed countries in 2018. As, e-commerce achieves higher goals in developing countries, and it will defeat barriers to adopt high-speed networks which are fast enough for mobiles and shipping prices.\n\nThese limitations can only be overcome by more reliable infrastructure and greater range. As the demand for eCommerce increases in some of the major business sectors. A bigger percentage of the online population will be buying online goods by 2019 in many countries. Around 50% of the population in emerging markets will shop online by 2020.",
      "\nWhen we decided to search for errors in the Azure SDK for .NET project, we were pleasantly surprised by its size. «Three and a half million lines of code,» we kept saying, studying the project's statistics. There might be so many findings. Alas and alack! The project turned out to be crafty. So what was the zest of the project and how it was checked — read in this article.",
      "Я расскажу о проблемах с которыми столкнулся, выбрав Python3 первым языком.\nЯ не изучал программирование в университете. \nЯ не хочу начинать holywar.\n\nВ 2016 Google советовал учить Python3 если нужен:\n\n1. Легкий для старта язык.\n2. Язык для машинного обучения.\n3. Язык для простых 2d игр.\n\n1. Я посмотрел первую лекцию курса Harvard CS50 на сайте JavaRush и понял, что не хочу: \n\n#include <stdio.h>\nint main(int argc, const char *argv[]) {\n    printf(\"Hello world\\n\");\n    return 0;\n}\n\nКогда можно так:\n\nprint('Monty Python')\n\nJavaScript испугал комбинацией из трех систем: JS/HTML/CSS.\n\n2. Машинное обучение вдохновляло тем, что все статьи и примеры напоминали киберпанк и научную-фантастику.\n\n3. Можно программировать игры? Супер!",
      "\n\nVirtual phone systems and CRM need little introduction to anyone active in the business world. A look at a range of recent studies indicates that close to 40% of American businesses make at least partial use of VoIP today. The CRM software market is also growing rapidly with estimates that it will be bringing in an astonishing $80 billion in revenues in five years time. What do these two technologies share in common?",
      "Author: Sergey Lukyanchikov, Sales Engineer at InterSystems\n\nFixing the terminology\nA robot is not expected to be either huge or humanoid, or even material (in disagreement with Wikipedia, although the latter softens the initial definition in one paragraph and admits virtual form of a robot). A robot is an automate, from an algorithmic viewpoint, an automate for autonomous (algorithmic) execution of concrete tasks. A light detector that triggers street lights at night is a robot. An email software separating e-mails into “external” and “internal” is also a robot.\n\nArtificial intelligence (in an applied and narrow sense, Wikipedia interpreting it differently again) is algorithms for extracting dependencies from data. It will not execute any tasks on its own, for that one would need to implement it as concrete analytic processes (input data, plus models, plus output data, plus process control). The analytic process acting as an “artificial intelligence carrier” can be launched by a human or by a robot. It can be stopped by either of the two as well. And managed by any of them too.\n",
      "\n\nArtificial Intelligence refers to the theory of computer systems or human-made robots programmed with performing tasks as humans, such as learning, generalization, and reasoning. With this ability, AI has become a significant part of human lives. Similarly, AI and the education & tutoring web solutions are inseparable from being observed by the astounding inventions enabling machines to mimic human roles.\n",
      "\n\nRetouchMe is a popular app in which professional designers can edit your photos in 10-15 minutes.\nIn the US it ranks between 100th and 150th on the top chart for App Store applications (in the «Photo and Video» category).\n\n\n17 million installs in 150 countries\nLocalization into 35 languages\n10-15 minutes average photo editing time\nAn army of designers and moderators in various countries\nAvailable in the App Store and Google Play, as well as the Amazon AppStore and the Samsung Galaxy Store\n\nRetouchMe turns to Alconost for their localization needs, and translates updates using our Nitro online service. \n\nThe RetouchMe team shared with Nitro how localization helped them reach top rankings in many countries, whether localization into 35 languages paid off, and how to add new features in just 24-48 hours without the need for a new release.",
      "Another release is out for the Windows Terminal preview! This release is labeled as v0.7 in the About section of the Terminal. As always, you can download the Terminal from the Microsoft Store and from the GitHub releases page. Here’s what’s new in this release:\n\nWindows Terminal Updates\nPanes\nYou are now able to split your Terminal window into multiple panes! This allows you to have multiple command prompts open at the same time within the same tab.\n\nNote: At the moment, you’re only able to open your default profile within a new pane. Opening a profile of your choice is an option we’re planning to include in a future release!\n\n\n\nRead more below.",
      "\n\nMusic is seen as one of the most important aspects of life. Without it, life can be a bit dull and monotonous. While entertainment is mainly the purpose of music, recent studies and research attest that music impacts many things in one’s life, including focus and productivity.\n\nBenefits of Music\nFor many years now, music has been seen to offer numerous benefits to people who listen and utilize music. Aside from stirring emotions and memories, music can enhance mental performances and even cognitive functions. And this is probably one of the main reasons why parents send their kids to music lessons as young as possible. ",
      "\nThe AI Cup community and Mail.ru Group in collaboration with Codeforces.com invite you to the real battle! Get ready for the sleepless nights and calloused hands — take part in Russian AI Cup, which is one of the most challenging and vivid artificial intelligence programming competitions in the world. Believe us, managers of this madness did their best to create the game you'd want to play. \nTo become part of the competition, you need Internet access, computer, creativity, and enthusiasm for being a part of this extraordinary Cup. By the way, you might need some coffee. Welcome! ",
      "\nIn the first part, we have deployed a simple dynamic CDN for broadcasting WebRTC streams to two continents and have proved on the example of a countdown timer that the latency in this type of CDN is actually low.\nIn the second part, we have incorporated dedicated servers into the CDN for performing the task of transcoding in order to provide good broadcast quality to our viewers based on the devices they use and the channel quality. In this manner, all published streams in our CDN are available to all the viewers.\nNow, assume that a company is starting to introduce its monetization strategy where a number of streams should be available for free and the rest on a subscription basis. Or, for example, webinars for in-house staff training are broadcasted simultaneously, but each subsidiary has a separate stream, and disclosing the sales techniques used in Southeast Asia to the managers from CIS countries is undesirable.",
      "\nDuring the summer of 2019, Huawei gave a series of presentations announcing the Ark Compiler technology. The company claims that this open-source project will help developers make the Android system and third-party software much more fluent and responsive. By tradition, every new promising open-source project goes through PVS-Studio for us to evaluate the quality of its code.\n\nIntroduction\nThe Ark Compiler was first announced by Huawei at the launch of the new smartphone models P30 and P30 Pro. It is claimed that the Ark Compiler will improve the fluency of the Android system by 24% and response speed by 44%. Third-party Android applications will also gain a 60% speed-up after recompilation with the Ark Compiler. The open-source version of the project is called OpenArkCompiler; its source code is available on Gitee, a Chinese fork of GitHub.",
      "React Native is the best open-source framework for Mobile App Developers that proved to be an advanced platform. Developed and promoted by Facebook, React Native became the most leading platform in the market. It can deliver apps on any platform with excellent performance and reliability. The ultimate aim of React Native is to cut down the reliance on web technologies like HTML and boost more dependence on native app development.\n\nUpgrades are all about exciting features from the old version. We update our mobile applications regularly to check the new features in different apps. Comparing to the 0.59 version, React Native 0.6 update has some great features in the list that will make the react native app development process quite smoother and easier.\n\nFor each reacts native developer, all the improvements play a crucial role, so we’ve drafted some exciting features that will make the process quite simple.",
      "Visual Studio IntelliCode uses machine learning to offer useful, contextually-rich code completion suggestions as you type, allowing you to learn APIs more quickly and code faster. Although IntelliCode’s base model was trained on over 3000 top open source C# GitHub repositories, it does not include all the custom types in your code base. To produce useful, high-fidelity, contextually-rich suggestions, the model needs to be tailored to unique types or domain-specific APIs that aren’t used in open source code. To make IntelliSense recommendations based on the wisdom of your team’s codebase, the model needs to train with your team’s code.\n\nEarlier this year, we extended our ML model training capabilities beyond our initial Github trained base model to enable you to personalize your IntelliCode completion suggestions by creating team models trained on your own code.\n\n",
      "\nIn the first part we have deployed a simple dynamic CDN for broadcasting WebRTC streams to two continents and have proved on the example of a countdown timer that the latency in this kind of CDN is actually low.\nHowever, besides low latency, it is important to provide good broadcast quality to users. After all, this is what they are paying for. In real life the channels between Edge servers and users can differ in bandwidth capacity and quality. For example, we are publishing a 720p stream at 2 Mbps, the user is playing it on an Android phone using 3G connection in an unstable signal reception area and the 360p maximum resolution that provides smooth picture at 400 Mbps is 360p. ",
      "\nA Zero-day (0-day) vulnerability is a computer-software vulnerability introduced during the development process and not yet discovered by the developers. Zero-day vulnerabilities can be exploited by hackers, thus affecting the company's reputation. Developers should seek to minimize the number of defects leading to such vulnerabilities. PVS-Studio, a static code analyzer for C, C++, C#, and Java code, is one of the tools capable of detecting security issues.",
      "Well, we've already discussed isolation and made a digression regarding the low-level data structure. And we've finally reached the most fascinating thing, that is, row versions (tuples).\n\nTuple header\nAs already mentioned, several versions of each row can be simultaneously available in the database. And we need to somehow distinguish one version from another one. To this end, each version is labeled with its effective «time» (xmin) and expiration «time» (xmax). Quotation marks denote that a special incrementing counter is used rather than the time itself. And this counter is the transaction identifier.\n\n(As usual, in reality this is more complicated: the transaction ID cannot always increment due to a limited bit depth of the counter. But we will explore more details of this when our discussion reaches freezing.)",
      "Do you know there were 5 million apps in 2019? Out of these millions of apps, only a few are able to perform. There are many reasons for this but a major factor is the interactivity of an app.\n\nNo matter which product you are trying to sell, customers choose the one which allows them to get involved. Interactive apps are in demand for a long time. Are you wondering how can you make an interactive app?\n\nThe first thing which comes to our mind when we talk about interactive apps is the concept of single page application. This is because SPAs are known for their capacity to interact with the user by reloading some page elements dynamically depending upon the interaction by the user.",
      "\nWe've developed a unified four-layer model for app promotion and added our recommendations.Before we wrote this article we had our apps downloaded over two million times, ran about 50 large promotional campaigns, and made it onto the App Store top-lists in over 24 countries to finally combine all of it into a single workflow.\nYou won’t find almost any obvious stuff about keywords, nice-looking icons, screenshots, or ad campaigns in this article. We’ve tried to develop a unified model for a product-focused company based on our experience by answering the questions “What? When? Why?” and even “And what then?”\nIf you’re developing your own app, want to start developing one, or just have a friend who’s a developer or marketing professional at a product-focused company, you’ll find lots of useful information in this article.",
      "\n\nBeing a developer, I love to code especially in JavaScript. As per my experience, using reduce function is one of the toughest tasks in JS. Let me first elaborate on the Reduce concept!\n\nIn Wikipedia, it has many names viz.\n\nReduce\nFold\nAccumulate\nAggregate\nCompress\n\nIt is a function that folds a list into any data type. It's all about breaking a structure down into a single value. It's like folding a box! With reduce, you can turn an array [1,2,3,4,5] into the number 15 by adding them all up."
    ]
  },
  {
    "title": [
      "\n    Future of E-commerce | E-Commerce Trends\n  ",
      "\n    Azure SDK for .NET: Story about a Difficult Error Search\n  ",
      "\n    Python или не Python\n  ",
      "\n    Unleashing the Potential of CRM and Virtual Telephony Integration\n  ",
      "\n    AI Robotization with InterSystems IRIS Data Platform\n  ",
      "\n    The Future of Artificial Intelligence in the Education System: Everything One Should Know\n  ",
      "\n    The RetouchMe Case Study: What We Learned from Localizing an App into 35 Languages\n  ",
      "\n    Windows Terminal Preview v0.7 Release\n  ",
      "\n    Music and Productivity in the Workplace: How Music Can Help You Be More Productive\n  ",
      "\n    СodeSide. The new game for Russian AI Cup\n  ",
      "\n    Dynamic CDN for Low Latency WebRTC Streaming with Stream Access Control\n  ",
      "\n    Checking the Ark Compiler Recently Made Open-Source by Huawei\n  ",
      "\n    React Native Introduces new version 0.60 | React Native updates & Features\n  ",
      "\n    AI-assisted IntelliSense for your team’s codebase\n  ",
      "\n    Dynamic CDN for Low Latency WebRTC Streaming with Transcoding\n  ",
      "\n    PVS-Studio Static Analyzer as a Tool for Protection against Zero-Day Vulnerabilities\n  ",
      "\n    MVCC in PostgreSQL-3. Row Versions\n  ",
      "\n    Angular: The Best Building Companion for Interactive apps\n  ",
      "\n    Promoting an App on the App Store and Google Play\n  ",
      "\n    Cracking Reduce Concept In Just 10 Minutes\n  "
    ]
  },
  {
    "time": [
      "today at 02:20 PM",
      "today at 09:13 AM",
      "yesterday at 11:16 PM",
      "yesterday at 03:34 PM",
      "yesterday at 03:09 PM",
      "December 4, 2019 at 03:36 PM",
      "December 4, 2019 at 02:33 PM",
      "December 4, 2019 at 10:00 AM",
      "December 3, 2019 at 02:59 PM",
      "December 2, 2019 at 07:31 PM",
      "December 2, 2019 at 12:19 PM",
      "December 2, 2019 at 09:39 AM",
      "November 29, 2019 at 04:35 PM",
      "November 29, 2019 at 10:00 AM",
      "November 28, 2019 at 07:11 PM",
      "November 28, 2019 at 10:17 AM",
      "November 27, 2019 at 02:36 PM",
      "November 27, 2019 at 11:45 AM",
      "November 27, 2019 at 05:51 AM",
      "November 26, 2019 at 08:57 PM"
    ]
  }
]