[
  {
    "content": [
      "Catch Noah Baumbach’s story of a marriage’s collapse, and a televised performance of the colorful Broadway musical.",
      "In addition to his acclaimed turn as Roy Cohn on Broadway, he was known for his work in “Norma Rae,” “Slaughterhouse-Five” and other films.",
      "Jonty Bravery, who faced one count of attempted murder, intended to kill the boy so he could be on the news, the authorities said.",
      "Michael Eric Dyson’s book, “Jay-Z: Made in America” is new on the nonfiction list this week.",
      "In Hulu’s “Reprisal,” Abigail Spencer plays a woman on an implacable mission in a Southern gothic tale of brawling gangs and tender male pride.",
      "For “Texas Flood,” their oral history of the legendary blues guitarist, Alan Paul and Andy Aledort talked to his family, bandmates and crew.",
      "A five-part crossover story, premiering Sunday on CW, will include some unexpected characters.",
      "Working undercover for the illusionist, Mackenberg exposed phony psychics who claimed they could connect people to their dead loved ones.",
      "“Music for Ensemble and Orchestra” had its New York premiere on Thursday with the New York Philharmonic and Jaap van Zweden.",
      "In its sixth year on Broadway, “The Illusionists” serves up familiar routines, but two smaller shows deliver egghead charm and brainy sleight-of-hand."
    ]
  },
  {
    "title": [
      "What’s on TV Saturday: ‘Marriage Story’ and ‘The SpongeBob Musical’",
      "Ron Leibman, Tony Winner for ‘Angels,’ Is Dead at 82",
      "Teenager Pleads Guilty to Throwing Boy Off Balcony at Tate Modern in London",
      "‘I’m a Business, Man’",
      "‘Reprisal’ Review: A Femme Fatale on the Midnight Train to Revenge",
      "Stevie Ray Vaughan Remembered by Those Who Knew Him Best",
      "A ‘Crisis’ Brings Together Many DC Comics Heroes",
      "Overlooked No More: Rose Mackenberg, Houdini’s Secret ‘Ghost-Buster’",
      "Review: Steve Reich Makes a Rare Venture Into the Orchestra",
      "Holiday Magic: Fooled and Fooled and Fooled Again"
    ]
  }
]