[
  {
    "content": [
      "The military academy used a flag with a skull and crossbones and “G.F.B.D.”, which stands for “God Forgives, Brothers Don’t.” The slogan has been associated with white supremacists.",
      "A no-nonsense decision victory put Joshua’s star career back on track. Ruiz acknowledged too much revelry after his previous win and not enough preparation for the rematch.",
      "The announcement came after Kiffin led Florida Atlantic to a win in the Conference USA title game.",
      "A video appeared to show a man mimicking monkey gestures near Jesse Lingard and Fred during the second half of the Manchester Derby.",
      "His 1-shot victory included an eagle on the 15th hole in the final round.",
      "Despite playing at a slow pace, Virginia has always had an effective offense. Not this season.",
      "Utah, ranked fifth by the committee that decides the playoff, was upended by Oregon in the Pac-12 Conference title game, 37-15.",
      "Is it too much to hope that the owner James Dolan will someday make the one move that might save his team?",
      "Manning, the longtime Giants quarterback, is in line for his first start in three months with Daniel Jones injured.",
      "The Wilpons had limited successes after becoming majority owners of the Mets in 2002. But the team’s dysfunction was mirrored by the family discord that ultimately forced a sale."
    ]
  },
  {
    "title": [
      "West Point Strips Racist Motto From Its Football Team Flag",
      "Anthony Joshua Takes Back Heavyweight Crown from Andy Ruiz",
      "Lane Kiffin Hired by Ole Miss as Next Coach",
      "Manchester United Players Targeted With Racial Abuse by City Fans",
      "Henrik Stenson Wins the Hero World Challenge",
      "Virginia Is the National Champion. But It Can’t Seem to Make a Shot",
      "Utah Had a Shot at the College Football Playoff. Oregon Spoiled It.",
      "The Knicks Fired Their Coach. He Isn’t the Guy Who Needs to Go.",
      "Eli Manning Is Ready for Another Chance",
      "Fans Didn’t Like the Way Jeff Wilpon Ran the Mets. Neither Did Some of His Relatives."
    ]
  },
  {
    "imgUrl": [
      "https://static01.nyt.com/images/2019/12/08/multimedia/08xp-football/08xp-football-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/08/sports/08ruiz-print/07joshua-ruiz-01-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/07/sports/07mississippi-kiffin/07mississippi-kiffin-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/07/sports/07SOCCER-RACISM-WEB-2/07SOCCER-RACISM-WEB-2-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/07/sports/07GOLF-HERO-WEB-1/07GOLF-HERO-WEB-1-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/07/sports/07virginia-print/merlin_165447708_bab55116-6089-4809-8ce2-1cc7dfc99420-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/07/sports/07pac-12-01/merlin_165546144_5271a969-8f37-47b5-9f0f-d9a338d2c96a-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/06/sports/06powell-knicks/merlin_162561600_2f57ca6d-db6c-4b3e-bc07-c4d9a7c616f4-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/06/sports/06nfl-eli-lede/merlin_163489740_041c30a5-6451-4ca9-a4c4-a40104c8dc97-thumbWide.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2019/12/06/sports/00mets-wilpons1-sub/merlin_165528318_0c61619c-d4ec-4214-a0a4-146d4fa99ca9-thumbWide.jpg?quality=75&auto=webp&disable=upscale"
    ]
  }
]